---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExternalDefinition
source: html/a4da80b2-5173-a24b-375a-c9932a1fa3d4.htm
---
# ExternalDefinition Properties

The description of the parameter. The description will be used as tooltip in the Revit UI including in the properties palette.